In [14]:
import pandas as pd
import numpy as np 
import matplotlib.pyplot as plt
import seaborn as sns

In [16]:
dict1 = {'Name':['Ramesh','Suresh','Sathish',np.nan],
         'Age':[30,33,np.nan,36],
         'City':[np.nan,'Hyd','Hyd','Blr']}

In [17]:
data = pd.DataFrame(dict1)
data

      Name   Age City
0   Ramesh  30.0  NaN
1   Suresh  33.0  Hyd
2  Sathish   NaN  Hyd
3      NaN  36.0  Blr

In [18]:
data.isnull()

    Name    Age   City
0  False  False   True
1  False  False  False
2  False   True  False
3   True  False  False

In [19]:
data.isnull().sum()

Name    1
Age     1
City    1
dtype: int64

**dropna**

In [20]:
data.dropna()

     Name   Age City
1  Suresh  33.0  Hyd

In [21]:
data.dropna(axis=1)

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

In [26]:
import warnings 
warnings.filterwarnings('ignore')

data.fillna(method='pad') 

# pad will take previous one as such  like we have age of suresh is 33 so 
# the sathish age is null in 2 if we apply pad method it will take suresh age

      Name   Age City
0   Ramesh  30.0  NaN
1   Suresh  33.0  Hyd
2  Sathish  33.0  Hyd
3  Sathish  36.0  Blr

In [28]:
data.fillna(method='backfill')
# backfill take next one

      Name   Age City
0   Ramesh  30.0  Hyd
1   Suresh  33.0  Hyd
2  Sathish  36.0  Hyd
3      NaN  36.0  Blr

In [29]:
data.fillna(method='ffill')

      Name   Age City
0   Ramesh  30.0  NaN
1   Suresh  33.0  Hyd
2  Sathish  33.0  Hyd
3  Sathish  36.0  Blr

In [30]:
age_mean = data['Age'].mean()
data["Age"].fillna(age_mean)

0    30.0
1    33.0
2    33.0
3    36.0
Name: Age, dtype: float64

# KNNImputer

In [33]:
from sklearn.impute import KNNImputer

In [34]:
imp = KNNImputer(n_neighbors= 3,weights='distance')

In [35]:
imp.fit_transform()

ValueError: could not convert string to float: 'Ramesh'